#+title: Using Mrsk
#+subtitle: Deployment testing
#+tags[]: mrsk
#+date: 2023-06-05

* Install =mrsk=

#+begin_src bash
  bundle add mrsk --group development
  alias mrsk="bundle exec mrsk"
#+end_src

Create the config file

#+begin_src bash :results raw
  mrsk init
#+end_src

#+RESULTS:
Created configuration file in config/deploy.yml
Created .env file
Created sample hooks in .mrsk/hooks


This will create =config/deploy.yml=.  For these tests, I created a
server and it's IP is below.

#+begin_src yaml :tangle config/deploy.yml
service: sampleapp
image: wschenk/sampleapp

servers:
  - 95.216.175.53

registry:
  username: wschenk
  password:
    - MRSK_REGISTRY_PASSWORD
#+end_src

* Testing

On your local machine, run =curl=

#+begin_src bash :results raw
curl http://95.216.175.53
#+end_src

#+RESULTS:
Hello world!

Now if we change our =app.rb= and run =mrsk deploy=, it only takes =29 seconds= and we can see

#+begin_src bash :results raw
curl http://95.216.175.53
#+end_src

#+RESULTS:
Hello world! From the redeploy

* Setting up an appliance

a/k/a redis

Lets see how to add a redis database to our system.

First we need to add the accessory to our =config/deploy.yml= file:

#+begin_src yaml :tangle config/deploy.yml
  accessories:
    redis:
      image: redis:latest
      roles:
        - web
      port: "36379:6379"
      volumes:
        - /var/lib/redis:/data
  env:
    REDIS_URL: redis://95.216.175.53:36379/1
#+end_src

Then we need to set it up:

#+begin_src bash
  mrsk accessory boot redis
#+end_src

We can then see the status

#+begin_src bash :results raw
  mrsk accessory details redis
#+end_src

#+RESULTS:
  INFO [4e06f84c] Running docker ps --filter label=service=sampleapp-redis on 95.216.175.53
  INFO [4e06f84c] Finished in 1.446 seconds with exit status 0 (successful).
CONTAINER ID   IMAGE          COMMAND                  CREATED         STATUS         PORTS                                         NAMES
712f345b9cbb   redis:latest   "docker-entrypoint.s…"   7 minutes ago   Up 7 minutes   0.0.0.0:36379->6379/tcp, :::36379->6379/tcp   sampleapp-redis

This starts up the app.  Now we need to update our code to actually
use it!

#+begin_src bash
  bundle add redis
#+end_src

Then our =app.rb=:

#+begin_src ruby :tangle app.rb
  require 'sinatra/base'
  require 'redis'

  class App < Sinatra::Base
    get '/' do
      redis = Redis.new( url: ENV['REDIS_URL'] )
      count = redis.incr("counter")
      "Hello world, called #{count} times"
    end

    get '/up' do
      "Yup"
    end
  end
#+end_src

#+begin_src bash :results raw
curl http://95.216.175.53
#+end_src

#+RESULTS:
Hello world, called 1 times

And

#+begin_src bash :results raw
curl http://95.216.175.53
#+end_src

#+RESULTS:
Hello world, called 2 times

